In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','klm']
    
})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  klm

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  klm

In [5]:
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  klm

### Finding Unique values

In [6]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
len(df['col2'].unique())

#or

df['col2'].nunique()

3

In [8]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

### Selecting Data - Conditional selection

In [9]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  klm

In [10]:
df[(df['col1'] > 2)  &  (df['col2'] == 666)]

   col1  col2 col3
2     3   666  ghi

In [11]:
## apply method - to apply your custom method to pandas

In [12]:
def times2(x):
    return x*2

In [13]:
df['col1'].apply(times2)    # custom method

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [14]:
df['col3'].apply(len)         # built-in method

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [15]:
df['col2'].apply(lambda x: x*2)  # lambda function

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

## Drop column

In [19]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  klm

### Column and Index

In [21]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting

In [23]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  klm
1     2   555  def
2     3   666  ghi

### null

In [24]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Pivot Table

In [28]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one',],
        'C':['x','y','x','y','x','y'],    
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [29]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [38]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN